Repository: Miemiemiemieqiang/swift-decision
Catalog: SwiftDecision/Localizable.xcstrings
Source language: en
Languages: zh_hans

# API Key 保存在本机钥匙串里，所有请求从手机直连你配置的服务，不经过任何中间服务器。
source: Your API key stays in the local Keychain. Every request goes straight from this device to the endpoint you configure — no middleman server.
zh_hans: API Key 保存在本机钥匙串里，所有请求从手机直连你配置的服务，不经过任何中间服务器。

# 上滑取消
source: Slide up to cancel
zh_hans: 上滑取消

# 为什么这么判断
source: Why this call
zh_hans: 为什么这么判断

# 任意 OpenAI 兼容服务的地址，填到 /v1 这一级，例如 https://api.openai.com/v1。
source: Any OpenAI-compatible endpoint, down to the /v1 level, e.g. https://api.openai.com/v1.
zh_hans: 任意 OpenAI 兼容服务的地址，填到 /v1 这一级，例如 https://api.openai.com/v1。

# 保存
source: Save
zh_hans: 保存

# 出了点问题
source: Something went wrong
zh_hans: 出了点问题

# 删了就找不回来了。
source: Once it's gone, it's gone.
zh_hans: 删了就找不回来了。

# 删掉所有定下来的事，不可恢复。
source: Deletes every sealed decision. This cannot be undone.
zh_hans: 删掉所有定下来的事，不可恢复。

# 删除
source: Delete
zh_hans: 删除

# 在听，松开就好
source: Listening… just release
zh_hans: 在听，松开就好

# 在纠结什么？
source: What are you stuck on?
zh_hans: 在纠结什么？

# 好
source: OK
zh_hans: 好

# 定下来的事会记在这里，只回看，不重新纠结。
source: Sealed decisions live here. Look back, don't re-litigate.
zh_hans: 定下来的事会记在这里，只回看，不重新纠结。

# 就这么定
source: Seal it
zh_hans: 就这么定

# 已保存
source: Saved
zh_hans: 已保存

# 已定
source: Decided
zh_hans: 已定

# 已定，不再想了
source: Sealed. Stop thinking about it.
zh_hans: 已定，不再想了

# 帮我定
source: Decide for me
zh_hans: 帮我定

# 快定
source: SwiftDecision
zh_hans: 快定

# 按住说话，松开上字
source: Hold to talk, release to insert
zh_hans: 按住说话，松开上字

# 换个角度
source: Another angle
zh_hans: 换个角度

# 松开取消
source: Release to cancel
zh_hans: 松开取消

# 松开手指，取消这次输入
source: Let go to discard this take
zh_hans: 松开手指，取消这次输入

# 模型名
source: Model
zh_hans: 模型名

# 模型响应格式异常，请重试。
source: The model returned a malformed response. Try again.
zh_hans: 模型响应格式异常，请重试。

# 比如：要不要去周五那个饭局
source: e.g. Should I go to Friday's dinner?
zh_hans: 比如：要不要去周五那个饭局

# 没有麦克风权限。去系统设置里打开，再按住说话。
source: No microphone access. Turn it on in system Settings, then hold to talk.
zh_hans: 没有麦克风权限。去系统设置里打开，再按住说话。

# 清空，不留痕迹
source: Clear it all, no trace
zh_hans: 清空，不留痕迹

# 清空全部 %lld 条记录？
source: Clear all %lld decisions?
zh_hans: 清空全部 %lld 条记录？

# 清空已定记录
source: Clear Decided History
zh_hans: 清空已定记录

# 结果还行吗？
source: How did it go?
zh_hans: 结果还行吗？

# 网络异常，请重试。
source: Network error. Try again.
zh_hans: 网络异常，请重试。

# 角度只能换一次
source: Only one new angle
zh_hans: 角度只能换一次

# 设置
source: Settings
zh_hans: 设置

# 语音模型没有打包进 App。先运行 Scripts/fetch_asr_deps.sh 再重新构建。
source: The speech model isn't bundled into the app. Run Scripts/fetch_asr_deps.sh, then rebuild.
zh_hans: 语音模型没有打包进 App。先运行 Scripts/fetch_asr_deps.sh 再重新构建。

# 请求失败（HTTP %lld）
source: Request failed (HTTP %lld)
zh_hans: 请求失败（HTTP %lld）

# 还没有决定过什么
source: Nothing decided yet
zh_hans: 还没有决定过什么

# 还没有配置好模型服务，请先到设置里填入 Base URL、API Key 和模型名。
source: Model service not set up. Fill in the Base URL, API key, and model name in Settings first.
zh_hans: 还没有配置好模型服务，请先到设置里填入 Base URL、API Key 和模型名。

# 这事不值得想
source: Not worth the thought
zh_hans: 这事不值得想
